задачник_едт/src/Documents/РасчетыПоРаботам/РасчетыПоРаботам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетыПоРаботам</name>
  <registerRecords>AccumulationRegister.ЗадолженостьКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетСИсполнителями</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ОбращениеВПоддержку</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

задачник_едт/src/Enums/ВидыОперацийРасчетов/ВидыОперацийРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасчетов</name>
  <enumValues>
    <name>ОплатаИсполнителю</name>
  </enumValues>
  <enumValues>
    <name>ОплатаЗаказчиком</name>
  </enumValues>
</mdclass:Enum>

задачник_едт/src/Documents/РасчетыПоРаботам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УдалитьДвижения();
	
	
	СтруктураДвижений = Новый Структура;
	ПолучитьТаблицыДвижений(СтруктураДвижений);
	Для Каждого ТДвижений из СтруктураДвижений Цикл
		Движения[ТДвижений.Ключ].Загрузить(ТДвижений.Значение);
		Движения[ТДвижений.Ключ].Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДвижения()
	Для Каждого ТаблицаДвижений из Движения Цикл
		ТаблицаДвижений.Очистить();
		ТаблицаДвижений.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьТаблицыДвижений(СтруктураДвижений)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоРаботамРасшифровка.Ссылка КАК Регистратор,
	|	РасчетыПоРаботамРасшифровка.Задача.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасчетыПоРаботамРасшифровка.Задача,
	|	РасчетыПоРаботамРасшифровка.Задача.ОбращениеОт КАК Отделение,
	|	РасчетыПоРаботамРасшифровка.Задача.РеальныйИсполнитель КАК Исполнитель,
	|	РасчетыПоРаботамРасшифровка.Сумма
	|ИЗ
	|	Документ.РасчетыПоРаботам.Расшифровка КАК РасчетыПоРаботамРасшифровка
	|ГДЕ
	|	РасчетыПоРаботамРасшифровка.Ссылка = &Ссылка
	|	И РасчетыПоРаботамРасшифровка.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасчетов.ОплатаИсполнителю)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоРаботамРасшифровка.Ссылка КАК Регистратор,
	|	РасчетыПоРаботамРасшифровка.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасчетыПоРаботамРасшифровка.Задача,
	|	РасчетыПоРаботамРасшифровка.Задача.ОбращениеОт КАК Отделение,
	|	РасчетыПоРаботамРасшифровка.Сумма
	|ИЗ
	|	Документ.РасчетыПоРаботам.Расшифровка КАК РасчетыПоРаботамРасшифровка
	|ГДЕ
	|	РасчетыПоРаботамРасшифровка.Ссылка = &Ссылка
	|	И РасчетыПоРаботамРасшифровка.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасчетов.ОплатаЗаказчиком)";
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураДвижений.Вставить("РасчетСИсполнителями", Результат[0].Выгрузить());
	СтруктураДвижений.Вставить("ЗадолженостьКлиентов", Результат[1].Выгрузить());
КонецПроцедуры
